//COLLDAP  JOB 1
//*********************************************************************
//GLDRFSET EXEC PGM=IKJEFT01
//SYSTSPRT DD SYSOUT=*
//ISFOUT   DD SYSOUT=*
//ISFIN    DD DUMMY
//SYSTSIN  DD *
 RDEFINE APPL  GLDSERV UACC(READ)
 SETROPTS RACLIST(APPL) REFRESH
 ADDGROUP GLDGRP +
  SUPGROUP(SYS1) OMVS(AUTOGID)

 ADDUSER GLDSRV +
  DFLTGRP(GLDGRP) +
  OMVS(AUTOUID  PROGRAM('/bin/sh'))


 PERMIT BPX.SERVER CLASS(FACILITY) +
  ID(GLDSRV) +
  ACCESS(UPDATE)

 PERMIT BPX.WLMSERVER CLASS(FACILITY) +
  ID(GLDSRV) +
  ACCESS(READ)

 PERMIT IRR.RAUDITX CLASS(FACILITY) +
  ID(GLDSRV) +
  ACCESS(READ)

 SETROPTS CLASSACT(FACILITY) RACLIST(FACILITY)
 SETROPTS RACLIST(FACILITY) REFRESH

 PERMIT SUPERUSER.FILESYS CLASS(UNIXPRIV) +
  ID(GLDSRV) +
  ACCESS(CONTROL)

 PERMIT SUPERUSER.FILESYS.CHOWN CLASS(UNIXPRIV) +
  ID(GLDSRV) +
  ACCESS(READ)

 SETROPTS CLASSACT(UNIXPRIV) RACLIST(UNIXPRIV)
 SETROPTS RACLIST(UNIXPRIV) REFRESH

 SETROPTS GENERIC(STARTED)
 RDEFINE STARTED +
  GLDSRV.** +
  STDATA(USER(GLDSRV))
 SETROPTS CLASSACT(STARTED) RACLIST(STARTED)
 SETROPTS RACLIST(STARTED) REFRESH

 PERMIT CSFOWH CLASS(CSFSERV) +
  ID(GLDSRV) +
  ACCESS(READ)
 SETROPTS CLASSACT(CSFSERV) RACLIST(CSFSERV)
 SETROPTS RACLIST(CSFSERV) REFRESH

 SETROPTS GENERIC(LDAP)
 RDEFINE LDAP GLDSEC.ADMINROLE.* UACC(NONE)
 RDEFINE LDAP GLDSEC.ADMINROLE.NOADMIN UACC(NONE)
 SETROPTS CLASSACT(LDAP)
/*
* RDEFINE FACILITY BPX.SERVER UACC(NONE)
* RDEFINE FACILITY BPX.WLMSERVER UACC(NONE)
* RDEFINE FACILITY IRR.RAUDITX UACC(NONE)
* RDEFINE UNIXPRIV SUPERUSER.FILESYS UACC(NONE)
* RDEFINE UNIXPRIV SUPERUSER.FILESYS.CHOWN UACC(NONE)
*RDEFINE CSFSERV CSFOWH UACC(NONE)
